Белгипрозем_2017/src/Catalogs/мСтрокиТаблиц/мСтрокиТаблиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мСтрокиТаблиц</name>
  <owners>Catalog.мТаблицыНормВремени</owners>
  <attributes>
    <name>НомерСтрокиТаблицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрОбъектаВСтрокеДляУсловия</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрОбъектаВСтрокеДляКоличества</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтадияРабот</name>
    <comment>Для печати в смете</comment>
    <type>
      <types>CatalogRef.мСтадииРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаДиапазона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчета</name>
    <type>
      <types>EnumRef.ВариантыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПоследующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУсловияСтроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУсловияКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКоличество</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийЭлемент</name>
    <type>
      <types>CatalogRef.мСтрокиТаблиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСборник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/ВариантыРасчетов/ВариантыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРасчетов</name>
  <enumValues>
    <name>Интервал</name>
  </enumValues>
  <enumValues>
    <name>КаждыеПоследующие</name>
  </enumValues>
  <enumValues>
    <name>Сверх</name>
  </enumValues>
  <enumValues>
    <name>КаждыеПоследующиеВИнтервале</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/мСтрокиТаблиц/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Элементы.Условия.Видимость = Объект.ИспользоватьУсловияСтроки;
    Если Объект.ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующие Тогда
        Элементы.ДляПоследующих.Видимость = Истина;
        Элементы.ПредыдущийЭлемент.Видимость = Истина;
    Иначе
        Элементы.ПредыдущийЭлемент.Видимость = Ложь;
        Элементы.ДляПоследующих.Видимость = Ложь;
    КонецЕсли; 
    
    Если Объект.Ссылка.Пустая() Тогда
        Объект.СсылкаНаСборник = Объект.Владелец.СсылкаНаСборник;
    КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаименование()
	Объект.Наименование = "";
    Если Объект.ИспользоватьУсловияСтроки Тогда
        Если Объект.НижняяГраницаДиапазона > 0 Тогда
            Если Объект.ВерхняяГраницаДиапазона = 0 Тогда
                Если Объект.ВариантРасчета = ПредопределенноеЗначение("Перечисление.ВариантыРасчетов.КаждыеПоследующие") Тогда
                    Объект.Наименование = Объект.Наименование + "На кажд. посл. "+Объект.ДляПоследующих;
                Иначе	
                    Объект.Наименование = Объект.Наименование + "Сверх "+Объект.НижняяГраницаДиапазона;
                КонецЕсли; 
            Иначе
                Объект.Наименование = Объект.Наименование + "От "+Объект.НижняяГраницаДиапазона + " до "+Объект.ВерхняяГраницаДиапазона;
            КонецЕсли;
        Иначе	
            Если Объект.ВерхняяГраницаДиапазона > 0 Тогда	
                Объект.Наименование = "До "+Объект.ВерхняяГраницаДиапазона;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.Наименование)  Тогда	
		Объект.Наименование = ""+Объект.СтадияРабот;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(Объект.НомерПодСтроки) Тогда
        Объект.Наименование = "("+СокрЛП(Объект.НомерСтрокиТаблицы) + "-" + СокрЛП(Объект.НомерПодСтроки) + ") " + Объект.Наименование;
    Иначе
        Объект.Наименование = "("+СокрЛП(Объект.НомерСтрокиТаблицы) + ") " + Объект.Наименование;
    КонецЕсли; 
	
КонецПроцедуры
	
&НаКлиенте
Процедура НижняяГраницаДиапазонаПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВерхняяГраницаДиапазонаПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВариантРасчетаПриИзменении(Элемент)
	СоздатьНаименование();
	
	ЗадатьВидимостьЭлементов();
 КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВидимостьЭлементов()
    ИмяВарианта = ПолучитьИмяВарианта(Объект.ВариантРасчета);
    Если ИмяВарианта = "Интервал" Тогда
        Элементы.Коэффициент.Видимость = Ложь;
        Элементы.ДляПоследующих.Видимость = Ложь;
        
    ИначеЕсли ИмяВарианта = "Сверх" Тогда
        Элементы.Коэффициент.Видимость = Ложь;
        Элементы.ДляПоследующих.Видимость = Ложь;
        
    ИначеЕсли ИмяВарианта = "КаждыеПоследующие" Тогда
        Элементы.ПредыдущийЭлемент.Видимость = Истина;
        Элементы.ДляПоследующих.Видимость = Истина;
        
        Элементы.Коэффициент.Видимость = Ложь;
        
    ИначеЕсли ИмяВарианта = "КаждыеПоследующиеВИнтервале" Тогда
        Элементы.ДляПоследующих.Видимость = Истина;
        Элементы.Коэффициент.Видимость = Истина;
    КонецЕсли; 
 КонецПроцедуры // ЗадатьВидимостьЭлементов()

&НаСервереБезКонтекста
Функция ПолучитьИмяВарианта(ВариантРасчета)
    Если ВариантРасчета = Перечисления.ВариантыРасчетов.Интервал Тогда
        Возврат "Интервал";
    ИначеЕсли ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующие Тогда
        Возврат "КаждыеПоследующие";	
    ИначеЕсли ВариантРасчета = Перечисления.ВариантыРасчетов.КаждыеПоследующиеВИнтервале Тогда
        Возврат "КаждыеПоследующиеВИнтервале";	
    ИначеЕсли ВариантРасчета = Перечисления.ВариантыРасчетов.Сверх Тогда
        Возврат "Сверх";	
    КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ДляПоследующихПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СтадияРаботПриИзменении(Элемент)
    СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУсловияСтрокиПриИзменении(Элемент)
    Элементы.Условия.Видимость = Объект.ИспользоватьУсловияСтроки;
    СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    Оповестить("Записана строка таблицы", , Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура НомерПодСтрокиПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НомерСтрокиТаблицыПриИзменении(Элемент)
	СоздатьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗадатьВидимостьЭлементов();
    ИспользоватьУсловияСтрокиПриИзменении(Неопределено);
    ИспользоватьКоличествоПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКоличествоПриИзменении(Элемент)
    УстановитьВидимостьПараметрОбъектаВСтрокеДляКоличества();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПараметрОбъектаВСтрокеДляКоличества()
    Элементы.ПараметрОбъектаВСтрокеДляКоличества.Видимость = (Объект.ИспользоватьКоличество или Объект.ИспользоватьЦены);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЦеныПриИзменении(Элемент)
    УстановитьВидимостьПараметрОбъектаВСтрокеДляКоличества();
КонецПроцедуры
